testing/load-tests/artillery-config.yml
# Artillery Load Testing Configuration for Multivendor Marketplace

config:
  target: 'http://localhost:4000'
  phases:
    # Warm-up phase
    - duration: 60
      arrivalRate: 5
      name: "Warm-up"

    # Normal load phase
    - duration: 300
      arrivalRate: 20
      name: "Normal Load"

    # Peak load phase
    - duration: 120
      arrivalRate: 50
      name: "Peak Load"

    # Stress test phase
    - duration: 60
      arrivalRate: 100
      name: "Stress Test"

    # Cool-down phase
    - duration: 30
      arrivalRate: 5
      name: "Cool-down"

  defaults:
    headers:
      Content-Type: 'application/json'

  # Environment variables
  variables:
    baseUrl: 'http://localhost:4000'
    authToken: ''  # Will be set by login scenario

  # Plugins
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}

  # Apdex configuration (Application Performance Index)
  apdex:
    threshold: 500  # 500ms satisfactory threshold

  # Ensure conditions
  ensure:
    thresholds:
      - http.response_time.p99: 1000  # 99th percentile < 1s
      - http.response_time.p95: 500   # 95th percentile < 500ms
      - http.error_rate: 1            # Error rate < 1%

# Global scenarios
scenarios:
  # Health check scenario
  - name: "Health Check"
    weight: 5
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200

  # API documentation access
  - name: "API Documentation"
    weight: 2
    flow:
      - get:
          url: "/api/docs"
          expect:
            - statusCode: 200

  # Service discovery
  - name: "Service Discovery"
    weight: 3
    flow:
      - get:
          url: "/api/services"
          expect:
            - statusCode: 200

# Include service-specific scenarios
include: ./scenarios/*.yml